of-run/canal/canal3D/05-owc-D19d12-snappy/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices (
    (-.025 -.025 -.025) //0
    (1.804 -.025 -.025)  //1
    (1.804 .666 -.025) //2  
    (-.025 .666 -.025) //3
    (-.025 -.025 .261) //4
    (1.804 -.025 .261) //5
    (1.804 .666 .261) //6
    (-.025 .666 .261) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (937 354 146) simpleGrading (1 1 1)
                                                                                                                                                                                                                                                                                          );

edges ();

boundary ();
 
mergePatchPairs ();

// ************************************************************************* //
