of-run/canal/canal3D/05-owc-D19d12-snappy/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh

runApplication snappyHexMesh -overwrite


runApplication setFields
#runApplication $application &

#pyFoamPlotWatcher.py log.interFoam

#------------------------------------------------------------------------------
